#include <stdio.h>

int main() {
    int t1, t2, t3;
    float time;

    // Введення користувачем часу t1, t2, t3, що позначатиме скільки часу потрібно кожному з гостей, щоб з'їсти пиріг
    printf("Enter three values:\n ");
    scanf("%d %d %d", &t1, &t2, &t3);
    // Перевірка умови, що надана в задачі (попередні значення при введенні мають бути більші за 10000)
 if(t1>10000 | t2>10000 |  t3>10000){
   printf("Error! Enter a number not exceeding 10000!");
   return 0;
 }
  else{
    // Знаходження сумарного часу, а саме ділимо цілу частину, в даному випадку пиріг, на суму часу, який потрібний кожному із гостей
    time = (1.0)/((1.0/t1) + (1.0/t2) + (1.0/t3));
    // Виведення результату округленого до 2 знаків після коми
    printf("The time required to eat the pie is %.2f hours\n", time);
  }
}
